"Common.Cancel" = "Отмена";

"Common.OK" = "ОК";

"Common.Info" = "Инфо";

"Common.Warning" = "Предупреждение";

"Common.Error" = "Ошибка";

"Common.Yes" = "Да";

"Common.No" = "Нет";

"Common.Settings" = "Параметры";

"Common.Logout" = "Выход";

/* MARK: - Endpoint */
"Endpoint.Training" = "https://ubilabstest.sapsailing.com";

/* MARK: - RegattaCheckInController */
"RegattaCheckInController.WelcomeAlert.Title" = "Здравствуйте, %@.";

"RegattaCheckInController.WelcomeAlert.Message" = "Вы выполняете вход как %@.";

"RegattaCheckInController.WelcomeAlert.CancelAction.Title" = "Это не я!";

/* MARK: - GPSFixController */
"GPSFixController.Mode" = "Режим";

"GPSFixController.Mode.Error" = "Ошибка API";

"GPSFixController.Mode.BatterySaving" = "Экономия энергии";

"GPSFixController.Mode.None" = "-";

"GPSFixController.Mode.Online" = "Онлайн";

"GPSFixController.Mode.Offline" = "Офлайн";

/* MARK: - LocationManager */
"LocationManager.LocationServicesDeniedError" = "Служба GPS выключена для этого приложения, но для отслеживания требуются позиции GPS. Включить GPS в настройках геолокации?";

"LocationManager.LocationServicesDisabledError" = "Служба GPS выключена, но для отслеживания требуются позиции GPS. Включить GPS в настройках геолокации?";

"LocationManager.Status" = "Статус";

"LocationManager.Status.Tracking" = "Отслеживание";

"LocationManager.Status.NotTracking" = "Нет сигнала GPS!";

/* MARK: - CheckInDataCollectorError */
"CheckInDataCollectorError.CheckInDataIsIncomplete" = "В QR-коде не найден идентификатор участника или отметки.";

/* MARK: - CheckInRequestManagerError */
"CheckInRequestManagerError.CommunicationFailed" = "Не удалось выполнить операцию на сервере. Повторите попытку.";

"CheckInRequestManagerError.GetBoatFailed" = "Не удалось найти лодку.";

"CheckInRequestManagerError.GetCompetitorFailed" = "Не удалось найти участника.";

"CheckInRequestManagerError.GetEventFailed" = "Не удалось найти событие.";

"CheckInRequestManagerError.GetLeaderboardFailed" = "Не удалось найти таблицу лидеров.";

"CheckInRequestManagerError.GetMarkFailed" = "Не удалось найти отметку.";

"CheckInRequestManagerError.GetTeamFailed" = "Не удалось найти команду.";

"CheckInRequestManagerError.PostCheckInFailed" = "Сбой чек-ина.";

"CheckInRequestManagerError.PostCheckOutFailed" = "Сбой чек-аута.";

"CheckInRequestManagerError.PostGPSFixFailed" = "Не удалось отправить позиции GPS.";

"CheckInRequestManagerError.PostTeamImageFailed" = "Не удалось загрузить изображение команды.";

"CheckInRequestManagerError.TeamImageURLIsInvalid" = "URL изображения команды недействителен.";

/* MARK: - StartView */
"StartView.RegattaButton.Title" = "Регаты";

"StartView.TrainingButton.Title" = "Одиночная тренировка";

/* MARK: - AboutView */
"AboutView.Title" = "О приложении";

"AboutView.PartnershipTextView.Text" = "Приложение SAP Sail InSight поддерживает отслеживание гоночных лодок в реальном времени с использованием технологии мобильной телефонии, предоставляя друзьям и болельщикам возможность следить за гонкой как на месте, так и онлайн с помощью обновляемых таблиц лидеров и двухмерной визуализации. Мореходы могут воспроизводить свои гонки, анализировать эффективность и оптимизировать стратегии, доступные по адресу: https://www.sapsailing.com\n\nSAP поддерживает US Sailing, внедряя всевозможные инновационные технологические решения для получения аналитики, помогающей командам и мореходам повышать эффективность, а также предоставляя приложения, помогающие более эффективно выполнять парусные операции.\n\nБудучи органом государственного управления в области парусного спорта, US Sailing обеспечивает руководство, честность и рост для спорта, включая тренировки и обучение для инструкторов и официальных лиц гонок наряду с администрированием и надзором за парусными соревнованиями по всей стране.";

"AboutView.TermsButton.Title" = "Лицензионное соглашение с конечным пользователем";

"AboutView.VersionTitleLabel.Text" = "Версия";

/* MARK: - CourseView */
"CourseView.TitleLabel.Text" = "Курс относительно грунта";

/* MARK: - RegattaCheckInListView */
"RegattaCheckInListView.Title" = "Регаты";

"RegattaCheckInListView.HeaderTitleLabel.Text" = "Ваши регаты:";

"RegattaCheckInListView.FooterTextView.Text" = "Подробности на сайте\nhttps://sapsailing.com";

"RegattaCheckInListView.InfoCodeLabel.Text" = "QR-код находится на вашем подтверждении участия.";

"RegattaCheckInListView.TermsAlert.Title" = "Лицензионное соглашение с конечным пользователем";

"RegattaCheckInListView.TermsAlert.Message" = "Используя настоящее Приложение, вы подтверждаете принятие лицензионного соглашения SAP SE с конечным пользователем. Прочтите текст соглашения здесь.";

"RegattaCheckInListView.TermsAlert.ShowTermsAction.Title" = "Лицензионное соглашение с конечным пользователем";

"RegattaCheckInListView.TermsAlert.AcceptTermsAction.Title" = "Подтвердить";

"RegattaCheckInListView.NoCameraAlert.Message" = "Устройство не имеет камеры.";

"RegattaCheckInListView.NoCodeAlert.Title" = "Нет QR-кода?";

"RegattaCheckInListView.NoCodeAlert.Message" = "Если вы не получили QR-код, обратитесь к руководству гонки.";

/* MARK: - TrainingCheckInListView */
"TrainingCheckInListView.Title" = "Тренировки";

"TrainingCheckInListView.HeaderTitleLabel.Text" = "Ваши тренировки:";

"TrainingCheckInListView.FooterTextView.Text" = "Для управления вашими тренировками создайте не менее одной тренировки с помощью кнопки «плюс».";

/* MARK: - TrainingView */
"TrainingView.LeaderboardButton.Title" = "Анализировать";

"TrainingView.OptionSheet.CheckOutAction.Title" = "Удалить тренировку";

"TrainingView.FinishButton.Title" = "Завершить";

"TrainingView.ReactivateAlert.Title" = "Повторно активировать тренировку";

"TrainingView.ReactivateAlert.Message" = "Эта тренировка завершена. Действительно активировать ее повторно?";

"TrainingView.ReactivatedAlert.Title" = "Тренировка активна.";

"TrainingView.FinishAlert.Title" = "Завершить тренировку";

"TrainingView.FinishAlert.Message" = "Завершить эту тренировку?";

"TrainingView.FinishedAlert.Title" = "Тренировка успешно завершена.";

"TrainingView.CheckOutAlert.Message" = "ДЕЙСТВИТЕЛЬНО удалить эту тренировку с вашего устройства?";

/* MARK: - CreateTrainingView */
"CreateTrainingView.Title" = "Создать тренировку";

"CreateTrainingView.BoatClassNameLabel.Text" = "Класс лодок";

"CreateTrainingView.CreateTrainingButton.Title" = "Создать тренировку";

/* MARK: - LeaderboardView */
"LeaderboardView.Title" = "Таблица лидеров";

/* MARK: - LicenseView */
"LicenseView.Title" = "Информация о лицензии";

/* MARK: - RegattaView */
"RegattaView.CountdownDaysTitleLabel.Text" = "дн.";

"RegattaView.CountdownHoursTitleLabel.Text" = "ч.";

"RegattaView.CountdownMinutesTitleLabel.Text" = "мин.";

"RegattaView.StartLabel.Text.BeforeRegattaDidStart" = "До старта регаты:";

"RegattaView.StartLabel.Text.AfterRegattaDidStart" = "Регата идет.";

"RegattaView.AnnouncementLabel.Text" = "Слушайте уведомления.";

"RegattaView.EventButton.Title" = "Событие";

"RegattaView.StartTrackingButton.Title" = "Начать отслеживание";

"RegattaView.OptionSheet.CheckOutAction.Title" = "Чек-аут";

"RegattaView.CheckOutAlert.Message" = "ДЕЙСТВИТЕЛЬНО выйти? Для доступа к регате потребуется повторный вход с помощью предоставленного QR-кода!";

/* MARK: - CompetitorView */
"CompetitorView.SelectImageAlert.Title" = "Фотография";

"CompetitorView.SelectImageAlert.Message" = "Использовать существующее изображение или сделать новый снимок?";

"CompetitorView.SelectImageAlert.CameraAction.Title" = "Сделать снимок";

"CompetitorView.SelectImageAlert.PhotoLibraryAction.Title" = "Существующее";

"CompetitorView.TeamImageUploadRetryButton.Title" = "Ошибка при загрузке.\nНажмите, чтобы повторить.";

"CompetitorView.TeamImageAddButton.Title" = "Добавить фото команды";

"CompetitorView.UploadTeamImageFailureAlert.Title" = "Ошибка при загрузке изображения";

/* MARK: - ScanView */
"ScanView.Title" = "Скан. QR-код";

"ScanView.IncorrectCodeAlert.Message" = "Недействительный QR-код";

/* MARK: - SpeedView */
"SpeedView.TitleLabel.Text" = "Скорость относительно грунта";

/* MARK: - SettingsView */
"SettingsView.Title" = "Параметры";

"SettingsView.TableView.BatterySavingSection.Title" = "Экономия энергии";

"SettingsView.TableView.DeviceSection.Title" = "Данные о приборе";

"SettingsView.TableView.TrainingSection.Title" = "Район тренировки";

"SettingsView.BatterySavingTitleLabel.Text" = "Экономия энергии";

"SettingsView.BatterySavingDescriptionLabel.Text" = "Обновления GPS отправляются на сервер каждые %0.0f с.";

"SettingsView.DeviceIdentifierTitleLabel.Text" = "Идентификатор устройства";

"SettingsView.TrainingServerTitleLabel.Text" = "Конечная точка сервера";

/* MARK: - TimerView */
"TimerView.TitleLabel.Text" = "Время отслеживания";

/* MARK: - TrackingView */
"TrackingView.TableView.GPSFixesCell.GPSFixesTitleLabel.Text" = "Неотправленные замеры";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyTitleLabel.Text" = "Точность GPS";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyLabel.Text.NoGPS" = "нет GPS";

"TrackingView.StopTrackingButton.Title" = "Остановить отслеживание";

"TrackingView.StopTrackingAlert.Title" = "Подтвердите";

"TrackingView.StopTrackingAlert.Message" = "Действительно остановить отслеживание?";

